In [1]:
import io
import pandas as pd

In [2]:
data = u"""name|age|height|class|score
lily|28|168|english|90
lily|28|168|math|95
lucy|28|120|english|99
lucy|28|120|math|88
sun|27|161|english|98
sun|27|161|math|78
vincent|32|175|english|60
vincent|32|175|math|100
"""
d = pd.read_table(io.StringIO(data),sep='|')

In [3]:
d

      name  age  height    class  score
0     lily   28     168  english     90
1     lily   28     168     math     95
2     lucy   28     120  english     99
3     lucy   28     120     math     88
4      sun   27     161  english     98
5      sun   27     161     math     78
6  vincent   32     175  english     60
7  vincent   32     175     math    100

In [4]:
ng = d.groupby(["name","age","height"])

In [10]:
d[["name", "age", "height"]]

      name  age  height
0     lily   28     168
1     lily   28     168
2     lucy   28     120
3     lucy   28     120
4      sun   27     161
5      sun   27     161
6  vincent   32     175
7  vincent   32     175

In [36]:
noduplicate = d[["name", "age", "height"]].drop_duplicates()

In [37]:
noduplicate

      name  age  height
0     lily   28     168
2     lucy   28     120
4      sun   27     161
6  vincent   32     175

In [30]:
gb = d[["name", "age", "height"]].groupby(["name","age","height"], as_index=False)

In [31]:
age30 = d[d.age> 30]

In [38]:
age30.merge(noduplicate, on=["name", "age", "height"])

      name  age  height    class  score
0  vincent   32     175  english     60
1  vincent   32     175     math    100

In [20]:
gb.groups

{('lily', 28L, 168L): [0L, 1L],
 ('lucy', 28L, 120L): [2L, 3L],
 ('sun', 27L, 161L): [4L, 5L],
 ('vincent', 32L, 175L): [6L, 7L]}

In [5]:
ng.describe()
ng.max()

                   class  score
name    age height
lily    28  168     math     95
lucy    28  120     math     99
sun     27  161     math     98
vincent 32  175     math    100

In [6]:
d.groupby("name").max()

         age  height class  score
name
lily      28     168  math     95
lucy      28     120  math     99
sun       27     161  math     98
vincent   32     175  math    100

In [7]:
d

      name  age  height    class  score
0     lily   28     168  english     90
1     lily   28     168     math     95
2     lucy   28     120  english     99
3     lucy   28     120     math     88
4      sun   27     161  english     98
5      sun   27     161     math     78
6  vincent   32     175  english     60
7  vincent   32     175     math    100